In [36]:
# 0
import pandas as pd
import matplotlib.pyplot as plt

In [2]:
# d_Hospede
df_hospede = pd.read_csv('d_hospede.csv')
df_hospede.head()

   hospede_id    pais  uf          cidade faixa_etaria segmento
0           1  Brasil  PE       Fortaleza        46-60     Corp
1           2  Brasil  ES         Niterói        36-45    Lazer
2           3  Brasil  RS  Belo Horizonte        26-35    Lazer
3           4  Brasil  PR        Brasília        26-35    Lazer
4           5  Brasil  GO         Vitória        26-35    Lazer

In [3]:
# duplicada

df_hospede.duplicated().sum()

np.int64(0)

In [4]:
# Hotel 
df_hotel = pd.read_csv('d_hotel.csv')
df_hotel

,hotel_id,nome,cidade,uf,categoria_estrelas,possui_spa_flag
0,1,Nara Copacabana,Rio de Janeiro,RJ,4,1
1,2,Nara Paulista,São Paulo,SP,4,0
2,3,Nara Savassi,Belo Horizonte,MG,3,0
3,4,Nara Barra,Salvador,BA,4,1
4,5,Nara Batel,Curitiba,PR,3,0
5,6,Nara Meireles,Fortaleza,CE,5,1

In [5]:
df_hotel.duplicated().sum()

np.int64(0)

In [6]:
# Cancelamento
df_cancelamento = pd.read_csv('d_motivo_cancelamento.csv')
df_cancelamento.head()

   motivo_id              categoria                   descricao
0          1                  Preço     Encontrou tarifa melhor
1          2      Mudança de planos         Alteração de agenda
2          3  Problema de pagamento             Cartão recusado
3          4             Transporte  Cancelamento de voo/ônibus
4          5                 Outros        Motivo não informado

In [7]:
df_cancelamento.duplicated().sum()

np.int64(0)

In [8]:
df_cancelamento.isna().sum()

motivo_id    0
categoria    0
descricao    0
dtype: int64

In [9]:
# Plano tarifario
df_plano_tarifario = pd.read_csv('d_plano_tarifario.csv')
df_plano_tarifario.head()

,rate_plan_id,nome_plano,reembolsavel_flag,cafe_incluso_flag,politica_cancelamento
0,1,Flexível (Reembolsável),1,1,Cancelamento grátis até 48h antes
1,2,Não Reembolsável,0,0,Sem reembolso
2,3,Corporativo Flex,1,1,Cancelamento grátis até 24h antes
3,4,Pacote Fim de Semana,0,1,Sem reembolso
4,5,Promo Antecipada,0,0,Sem reembolso

In [10]:
df_plano_tarifario.duplicated().sum()

np.int64(0)

In [11]:
df_plano_tarifario.isna().sum()

rate_plan_id             0
nome_plano               0
reembolsavel_flag        0
cafe_incluso_flag        0
politica_cancelamento    0
dtype: int64

In [12]:
# agencia
df_agencia = pd.read_csv('d_agencia.csv')
df_agencia.head()

   agencia_id     nome     tipo  comissao_pct
0           1  Booking      OTA          0.15
1           2  Decolar      OTA          0.17
2           3      CVC  Agência          0.12
3           4  FlyTour  Agência          0.10

In [13]:
df_agencia.duplicated().sum()

np.int64(0)

In [14]:
df_agencia.isna().sum()

agencia_id      0
nome            0
tipo            0
comissao_pct    0
dtype: int64

In [15]:
# Canal
df_canal = pd.read_csv('d_canal.csv')
df_canal.head(6)

   canal_id      canal_nome canal_grupo
0         1   Direto - Site      Direto
1         2    Direto - App      Direto
2         3   OTA - Booking         OTA
3         4   OTA - Decolar         OTA
4         5     Corporativo        Corp
5         6  Agência Física     Agência

In [16]:
# data
df_data = pd.read_csv('d_data.csv')
df_data.head()

,data_id,data,ano,mes,nome_mes,trimestre,dia_semana,fim_de_semana_flag,feriado_flag,alta_temporada_flag
0,20240101,2024-01-01,2024,1,Jan,1,1,0,1,1
1,20240102,2024-01-02,2024,1,Jan,1,2,0,0,1
2,20240103,2024-01-03,2024,1,Jan,1,3,0,0,1
3,20240104,2024-01-04,2024,1,Jan,1,4,0,0,1
4,20240105,2024-01-05,2024,1,Jan,1,5,0,0,1

In [17]:
df_data.duplicated().sum()

np.int64(0)

In [18]:
df_data.isna().sum()

data_id                0
data                   0
ano                    0
mes                    0
nome_mes               0
trimestre              0
dia_semana             0
fim_de_semana_flag     0
feriado_flag           0
alta_temporada_flag    0
dtype: int64

In [19]:
# Diaria
df_diaria = pd.read_csv('f_diarias.csv')
df_diaria.head()

,hotel_id,data_id,tipo_quarto,quartos_vendidos,adr_estimado,receita_diarias
0,1,20240101,Standard,37,367.51,13597.84
1,1,20240102,Standard,39,424.36,16549.95
2,1,20240103,Standard,32,350.25,11207.86
3,1,20240104,Standard,35,309.44,10830.30
4,1,20240105,Standard,54,332.37,17948.08

In [20]:
df_diaria.duplicated().sum()

np.int64(0)

In [21]:
df_diaria.isna().sum()

hotel_id            0
data_id             0
tipo_quarto         0
quartos_vendidos    0
adr_estimado        0
receita_diarias     0
dtype: int64

In [38]:
df_diaria_novo = df_diaria.loc[df_diaria['receita_diarias'] > 0]
df_diaria_novo

,hotel_id,data_id,tipo_quarto,quartos_vendidos,adr_estimado,receita_diarias
0,1,20240101,Standard,37,367.51,13597.84
1,1,20240102,Standard,39,424.36,16549.95
2,1,20240103,Standard,32,350.25,11207.86
3,1,20240104,Standard,35,309.44,10830.30
4,1,20240105,Standard,54,332.37,17948.08
...,...,...,...,...,...,...
21925,6,20251227,Familia,14,763.34,10686.69
21926,6,20251228,Familia,16,709.42,11350.74
21927,6,20251229,Familia,14,644.95,9029.31
21928,6,20251230,Familia,13,869.08,11298.06
21929,6,20251231,Familia,14,748.11,10473.53

In [39]:
df_diaria_novo.to_csv('f_diarianovo.csv', sep = ';', index=False)

In [23]:
# Reserva
df_reserva = pd.read_csv('f_reservas.csv')
df_reserva.head()

,reserva_id,data_reserva_id,data_cancelamento_id,motivo_cancelamento_id,checkin_id,checkout_id,hotel_id,hospede_id,canal_id,agencia_id,rate_plan_id,tipo_quarto,status,adultos,criancas,valor_previsto,desconto,moeda
0,1,20240229,NaN,NaN,20240301,20240302,5,10394,1,NaN,5,Suite,Finalizada,2,2,909.80,0.0,BRL
1,2,20250522,20250610.0,2.0,20250622,20250625,5,10147,4,2.0,5,Deluxe,Cancelada,2,0,1533.72,0.0,BRL
2,3,20241209,NaN,NaN,20241228,20241229,5,11484,1,NaN,2,Superior,Finalizada,1,1,436.38,0.0,BRL
3,4,20250306,NaN,NaN,20250323,20250324,2,7030,2,NaN,3,Superior,Finalizada,2,1,270.76,0.0,BRL
4,5,20240423,20240504.0,2.0,20240527,20240528,5,4216,1,NaN,3,Deluxe,Cancelada,1,2,318.75,0.0,USD

In [24]:
df_reserva.duplicated().sum()

np.int64(80)

In [25]:
df_reserva.drop_duplicates

<bound method DataFrame.drop_duplicates of        reserva_id  data_reserva_id  data_cancelamento_id  \
0               1         20240229                   NaN
1               2         20250522            20250610.0
2               3         20241209                   NaN
3               4         20250306                   NaN
4               5         20240423            20240504.0
...           ...              ...                   ...
32075        2684         20240118                   NaN
32076       21255         20240724                   NaN
32077       25301         20240529                   NaN
32078       10869         20250228            20250305.0
32079       15432         20240523            20240524.0

       motivo_cancelamento_id  checkin_id  checkout_id  hotel_id  hospede_id  \
0                         NaN    20240301     20240302         5       10394
1                         2.0    20250622     20250625         5       10147
2                         NaN    20241228     20241229         5       11484
3                         NaN    20250323     20250324         2        7030
4                         2.0    20240527     20240528         5        4216
...                       ...         ...          ...       ...         ...
32075                     NaN    20240124     20240125         2        4916
32076                     NaN    20240801     20240803         1        5722
32077                     NaN    20240610     20240611         5        2094
32078                     3.0    20250309     20250312         2       11906
32079                     5.0    20240527     20240531         6        8623

       canal_id  agencia_id  rate_plan_id tipo_quarto      status  adultos  \
0             1         NaN             5       Suite  Finalizada        2
1             4         2.0             5      Deluxe   Cancelada        2
2             1         NaN             2    Superior  Finalizada        1
3             2         NaN             3    Superior  Finalizada        2
4             1         NaN             3      Deluxe   Cancelada        1
...         ...         ...           ...         ...         ...      ...
32075         5         NaN             4      Deluxe  Finalizada        2
32076         1         NaN             1      Deluxe  Finalizada        1
32077         1         NaN             1    Standard  Finalizada        1
32078         5         NaN             1    Standard   Cancelada        2
32079         5         NaN             3     Familia   Cancelada        1

       criancas  valor_previsto  desconto moeda
0             2          909.80      0.00   BRL
1             0         1533.72      0.00   BRL
2             1          436.38      0.00   BRL
3             1          270.76      0.00   BRL
4             2          318.75      0.00   USD
...         ...             ...       ...   ...
32075         2          487.25      0.00   BRL
32076         2         1128.11      0.00   BRL
32077         2          225.91     16.67   BRL
32078         0          782.05      0.00   BRL
32079         1         1291.48      0.00   BRL

[32080 rows x 18 columns]>

In [26]:
df_reserva.to_csv('f_reservanovo.csv', sep = ';', index=False)

In [27]:
# Pagamentos
df_pagamentos = pd.read_csv('f_pagamentos.csv')
df_pagamentos.head()

,pagamento_id,reserva_id,data_pagamento_id,forma_pagamento,valor_pago,status_pagamento,taxa_gateway
0,1,1,20240224,Crédito,892.93,Aprovado,25.00
1,2,3,20241225,Crédito,218.23,Estornado,6.11
2,3,3,20241226,Crédito,224.66,Aprovado,6.29
3,4,4,20250319,PIX,263.71,Aprovado,3.16
4,5,6,20240404,Crédito,3415.63,Aprovado,95.64

In [28]:
df_pagamentos.duplicated().sum()

np.int64(0)

In [29]:
df_pagamentos.isna().sum()

pagamento_id         0
reserva_id           0
data_pagamento_id    0
forma_pagamento      0
valor_pago           0
status_pagamento     0
taxa_gateway         0
dtype: int64

In [30]:
# Inventario diario
df_inventariodiario = pd.read_csv('f_inventario_diario.csv')
df_inventariodiario.head()

,hotel_id,data_id,tipo_quarto,quartos_total,quartos_manutencao,quartos_disponiveis
0,1,20240101,Standard,55,2,53
1,1,20240102,Standard,55,2,53
2,1,20240103,Standard,55,0,55
3,1,20240104,Standard,55,1,54
4,1,20240105,Standard,55,0,55

In [31]:
df_inventariodiario.duplicated().sum()

np.int64(0)

In [32]:
df_inventariodiario.isna().sum()

hotel_id               0
data_id                0
tipo_quarto            0
quartos_total          0
quartos_manutencao     0
quartos_disponiveis    0
dtype: int64

In [33]:
df_review = pd.read_csv('f_reviews.csv')
df_review.head()

,review_id,reserva_id,data_review_id,nota,limpeza,localizacao,atendimento,comentario_flag
0,1,4081,20240528,7.7,7.3,8.5,7.9,0
1,2,1095,20250816,9.0,8.8,8.6,7.4,0
2,3,12895,20250320,8.6,7.8,9.0,9.5,1
3,4,25185,20251017,6.4,6.2,5.9,6.5,0
4,5,13176,20241128,8.9,9.3,9.4,8.5,0

In [34]:
df_review.duplicated().sum()

np.int64(0)

In [35]:
df_review.isna().sum()

review_id          0
reserva_id         0
data_review_id     0
nota               0
limpeza            0
localizacao        0
atendimento        0
comentario_flag    0
dtype: int64

In [46]:
df_review_ratio = df_review.loc[(df_review['nota'].between(0,10)) | (df_review['limpeza'].between(0,10)) | (df_review['localizacao'].between(0,10)) | (df_review['atendimento'].between(0,10))]
df_review_ratio

,review_id,reserva_id,data_review_id,nota,limpeza,localizacao,atendimento,comentario_flag
0,1,4081,20240528,7.7,7.3,8.5,7.9,0
1,2,1095,20250816,9.0,8.8,8.6,7.4,0
2,3,12895,20250320,8.6,7.8,9.0,9.5,1
3,4,25185,20251017,6.4,6.2,5.9,6.5,0
4,5,13176,20241128,8.9,9.3,9.4,8.5,0
...,...,...,...,...,...,...,...,...
10767,10768,4983,20240425,7.7,7.6,8.0,8.0,1
10768,10769,31831,20240908,6.2,6.9,6.5,6.3,1
10769,10770,9662,20251225,5.4,5.7,5.7,5.5,0
10770,10771,22855,20250802,7.3,8.0,6.6,7.3,0
10771,10772,21865,20251031,9.1,9.3,8.1,9.8,0

In [48]:
df_review_ratio.to_csv('f_reviewsnovo.csv', sep=';', index=False)